# list_1 = [2, 4, 1, 6, 8, 2, 9, 3, 2, 5]
# k=2
# count = 0

# for i in range(len(list_1)):
#     if list_1[i] == k:
#         count += 1
# print(count)


# print(list_1.count(k))


# list_1 = [1, 12, 6, 7, 8, 15]
# k = 11


# for i in range(len(list_1)):
#     if list_1[i] == k:
#         print(k)
#         exit()
# for i in range(len(list_1)):
#     if list_1[i] == k - 1 or list_1[i] == k + 1:
#         k = list_1[i]
#         print(k)


# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.

# В случае с английским алфавитом очки распределяются так:

# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:

# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его. Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

# Пример:


# k = 'ноутбук'
# # 12
# k = "АЕН"

# list_dicts = {"А": "1", "В": "1", "Е": "1", "И": "1", "Н": "1", "О":"1", "Р":"1", "С": "1", "Т": "1", "A": "1", "E": "1", "I": "1", "О":"1", "U":"1",
#               "L":"1", "N":"1", "S": "1", "T": "1", "R": "1", "E": "1", "I": "1", "О":"1", "U":"1"}
# my_set = set()
# for curr_dict in k:
#     for val in list_dicts:
#         if


# eng = 'qwertyuiopasdfghjklzxcvbnm'

# rus = 'йцукенгшщзхъфывапролджэячсмитьбюё'

# list_English = {1:'AEIOULNSTR', 2:'DG', 3:'BCMP',
#                 4:'FHVWY', 5:"K" , 8:'JX', 10:'QZ'}
# list_Russian = {1:'АВЕИНОРСТ', 2:'ДКЛМПУ', 3:'БГЁЬЯ',
#                 4:'ЙЫ', 5:'ЖЗХЦЧ', 8:'ШЭЮ', 10:'ФЩЪ'}

# k = input('Введите слово на русском или английском языке: ')

# if k[0].lower() in eng:
#     summa = 0
#     for letter in k:
#         for key, value in list_English.items():
#             if letter.upper() in value:
#                 summa += key
#     print(f'стоимость введенного английского слова = {summa}')
# else:
#     if k[0].lower() in rus:
#         summa = 0
#         for letter in k:

#             for key, value in list_Russian.items():
#                 if letter.upper() in value:
#                     summa += key
#     print(f'стоимость введенного русского слова = {summa}')

# k = "ящерица"


# def calculate_scrabble_score(word, language):
#     # Определение словарей для английского и русского алфавитов
#     english_scores = {
#         "A": 1,
#         "B": 3,
#         "C": 3,
#         "D": 2,
#         "E": 1,
#         "F": 4,
#         "G": 2,
#         "H": 4,
#         "I": 1,
#         "J": 8,
#         "K": 5,
#         "L": 1,
#         "M": 3,
#         "N": 1,
#         "O": 1,
#         "P": 3,
#         "Q": 10,
#         "R": 1,
#         "S": 1,
#         "T": 1,
#         "U": 1,
#         "V": 4,
#         "W": 4,
#         "X": 8,
#         "Y": 4,
#         "Z": 10,
#     }

#     russian_scores = {
#         "А": 1,
#         "Б": 3,
#         "В": 1,
#         "Г": 3,
#         "Д": 2,
#         "Е": 1,
#         "Ё": 3,
#         "Ж": 5,
#         "З": 5,
#         "И": 1,
#         "Й": 4,
#         "К": 2,
#         "Л": 2,
#         "М": 2,
#         "Н": 1,
#         "О": 1,
#         "П": 2,
#         "Р": 1,
#         "С": 1,
#         "Т": 1,
#         "У": 2,
#         "Ф": 10,
#         "Х": 5,
#         "Ц": 5,
#         "Ч": 5,
#         "Ш": 8,
#         "Щ": 10,
#         "Ъ": 10,
#         "Ы": 4,
#         "Ь": 3,
#         "Э": 8,
#         "Ю": 8,
#         "Я": 3,
#     }

#     # Преобразование слова к верхнему регистру для удобства сопоставления букв и оценок
#     word = word.upper()

#     # Выбор соответствующего словаря на основе языка
#     scores_dict = english_scores if language == "english" else russian_scores

#     # Вычисление общей стоимости слова
#     score = sum(scores_dict[letter] for letter in word)

#     return score


# Пример использования

# score = calculate_scrabble_score(k, "russian")
# print(score)


name = input()
print(name, "- чемпион")